export function advantagesHandler(bot) {
    bot.onText(/Переваги навчання з нами/, async (msg) => {
        const chatId = msg.chat.id;
        await bot.sendMessage(
          chatId, 
          `🌟 **Фокус на розмовній англійській**\n
          Наша платформа створена, щоб тебе розговорити. Але й граматика буде обов'язково, без неї неможливо грамотно говорити.\n
      
          🧠 **Мудрі у своєму підході до навчання**\n
          Знаємо, що потрібно пропрацювати, щоб ви заговорили і не боялися проявлятися англійською.\n
      
          😊 **Щасливі, коли наші студенти починають говорити**\n
          90% заняття ТИ будеш говорити.\n
      
          💻 **Навчаємось на платформі**\n
          Навчайся з будь-якого гаджету. Матеріал структурований та інтерактивний. Використовуємо метод перевернутого уроку: студенти ДО заняття вчать слова, а не після; це дає змогу попрактикувати з викладачем потрібну лексику одразу на занятті.\n
      
          🌈 **Безпечний простір, де можна помилятися**\n
          Помилятись — це ОК. Щоб розговоритися, потрібно виговорювати помилки, щоразу покращуючи свій рівень.\n
      
          ⏳ **Знаємо, як знайти час на англійську**\n
          Поділимось секретами ефективного планування часу. Повір, рівень щастя в твоєму житті точно зросте!`
        );
      });
  }
  