export function faqHandler(bot, updateLastInteractionTime) {
  bot.onText(/Часті запитання/, async (msg) => {
      const chatId = msg.chat.id;
      await updateLastInteractionTime(chatId);

      await bot.sendMessage(
        chatId, 
        `<b>❓ Який формат краще: групові, парні чи індивідуальні?</b>\n
Все залежить від твоєї цілі: якщо хочеш більше говорити — обирай групові або парні заняття. Якщо маєш спецзапит та обмежений час для вивчення — обирай індивідуальний формат.\n\n
<b>👥 Як відбуваються групові заняття?</b>\n
Заняття триватиме 55 хв у міні-групі до 5-6 студентів з однаковим рівнем володіння мовою, щоб всім було комфортно. На заняттях ви будете пропрацьовувати всі аспекти мовлення: граматику, лексику, говоріння, навички сприйняття на слух і письмо. Але найбільше ви будете говорити! Ми дбаємо, щоб ви отримали результат якісно і назавжди.\n\n
<b>❌ Як я можу скасувати підписку?</b>\n
Наш адміністратор допоможе призупинити або скасувати підписку у разі потреби.`,
        { parse_mode: "HTML" }
      );
  });
}
