const packagesInfo = {
    "Персональні для школярів. 8 занять": {
      message: `
  🎒 **Персональні для школярів (1-8 клас)**
  
  - 🗓️ Заняття з викладачем 2 рази на тиждень
  - 📚 Навчальна платформа з інтерактивними матеріалами
  
  💵 Щомісячний платіж: 4000 грн
  `,
      link: 'https://secure.wayforpay.com/button/b0b44e7ad8588'
    },
  
    "Групові. 8 занять": {
      message: `
  👥 **Групові заняття (8 занять)**
  
  - 👥 Групи 3-6 студентів, сформовані за віком та рівнем знань
  - 📚 Навчальна платформа для інтерактивних занять
  - 💻 Кожен студент працює на своєму пристрої
  - 🗓️ Заняття з викладачем 2 рази на тиждень
  
  💬 Максимум розмов у крутій компанії!
  💵 Щомісячний платіж: 2400 грн
  `,
      link: 'https://secure.wayforpay.com/button/b06a8dae6b729'
    },
  
  //   "Групові. 12 занять": {
  //     message: `
  // 👥 **Групові заняття (12 занять)**
  
  // - 👥 Групи 3-6 студентів, сформовані за віком та рівнем знань
  // - 📚 Навчальна платформа з інтерактивними матеріалами
  // - 💻 Кожен студент працює на своєму гаджеті, у своєму профайлі
  // - 🗓️ Заняття з викладачем 2 рази на тиждень
  
  // 💪 Регулярність — ключ до успіху!

  // 💵 Вартість: 2900 грн
  // `,
  //     link: 'https://payment-link-for-group-12-classes.com'
  //   },
  
    "Парні. 8 занять": {
      message: `
  🤝 **Парні заняття (8 занять)**
  
  - 📚 Навчальна платформа з інтерактивними матеріалами
  - 👥 Можна займатись із колегою чи другом або ми підберемо для тебе пару
  - 🗓️ Заняття з викладачем 2 рази на тиждень
  - 💬 Speaking Club
  
  Твій розмовний баді вже чекає!

  💵 Вартість: 3200 грн
  `,
      link: 'https://secure.wayforpay.com/button/b9508e7a924b0'
    },
  
  //   "Парні. 12 занять": {
  //     message: `
  // 🤝 **Парні заняття (12 занять)**
  
  // - 📚 Навчальна платформа з інтерактивними матеріалами
  // - 👥 Можна займатись із колегою чи другом або ми підберемо для тебе пару
  // - 🗓️ Заняття з викладачем 2 рази на тиждень
  // - 💬 Speaking Club
  
  // 6 тижнів розмовної англійської разом з твоїм Бадді!

  // 💵 Вартість: 4000 грн
  // `,
  //     link: 'https://payment-link-for-pair-12-classes.com'
  //   },
  
    "Індивідуальні. 8 занять": {
      message: `
  👤 **Індивідуальні заняття (8 занять)**
  
  - 🧑‍🏫 Персональні заняття з викладачем
  - 📚 Заняття на навчальній платформі
  - 🗓️ 2 рази на тиждень
  - 💬 Speaking Club

  💵 Вартість: 4800 грн
  `,
      link: 'https://secure.wayforpay.com/button/b93f682337e81'
    },
  
  //   "Індивідуальні. 12 занять": {
  //     message: `
  // 👤 **Індивідуальні заняття (12 занять)**
  
  // - 🧑‍🏫 Персональні заняття з викладачем
  // - 📚 Заняття на навчальній платформі
  // - 🗓️ Графік та інтенсивність обираєш ТИ
  // - 💬 Speaking Club

  // 💵 Вартість: 5800 грн
  // `,
  //     link: 'https://payment-link-for-individual-12-classes.com'
  //   },
  
  //   "Індивідуальні. 24 заняття": {
  //     message: `
  // 👤 **Індивідуальні заняття (24 заняття)**
  
  // - 🧑‍🏫 Персональні заняття з викладачем
  // - 📚 Заняття на навчальній платформі
  // - 🗓️ Графік та інтенсивність узгоджуємо індивідуально
  // - 💬 Speaking Club
  
  // 24 заняття за твоїм особистим графіком!

  // 💵 Вартість: 11500 грн
  // `,
  //     link: 'https://payment-link-for-individual-24-classes.com'
  //   },
  
    "Індивідуальні з Іриною. 8 занять": {
      message: `
  👤 **Індивідуальні заняття з Іриною (8 занять)**
  
  - 🧑‍🏫 Персональні заняття з Іриною, засновницею школи Happy&Wise
  - 📚 Заняття на навчальній платформі
  - 🗓️ 2 рази на тиждень
  - 💬 Speaking Club

  💵 Вартість: 7200 грн
  `,
      link: 'https://secure.wayforpay.com/button/b92f08ec78fe0'
    },
  
    "Індивідуальні заняття з носієм. 8 занять": {
      message: `
  👤 **Індивідуальні заняття з носієм. 8 занять**
  
  - Якщо твій рівень від В1, заняття з носієм допоможуть значно покращити твою англійську!

  💵 Вартість: 7200 грн
  `,
      link: 'https://secure.wayforpay.com/button/b58cbf8bf2eb6'
    },
  
    "Пакет Business English. 8 занять": {
      message: `
  💼 **Business English (8 занять)**
  
  - Рівень: від B2
  - Заняття, спрямовані на підвищення професійної англійської

  💵 Вартість: 5600 грн
  `,
      link: 'https://secure.wayforpay.com/button/b92f08ec78fe0'
    },
  
    "Test": {
      message: `
  💼 **Test**
  
  - Рівень: від B2
  - Заняття, спрямовані на підвищення професійної англійської

  💵 Вартість: 1 грн
  `,
      link: 'https://secure.wayforpay.com/button/b991fe49efa0d'
    }
  };
  
  export function sendPackageInfoHandler(bot) {
    bot.on('message', (msg) => {
      const chatId = msg.chat.id;
      const text = msg.text;
  
      // Проверка, есть ли текст в нашем объекте packagesInfo
      if (packagesInfo[text]) {
        const packageData = packagesInfo[text];
  
        // Отправляем сообщение с кнопкой "Придбати"
        bot.sendMessage(chatId, packageData.message, {
          parse_mode: 'Markdown',
          reply_markup: {
            inline_keyboard: [
              [
                { text: 'Придбати', url: packageData.link }
              ]
            ]
          }
        });
      }
    });
  }
  
  